var SHRI = require('./SHRI.js');

var source = {
    "students": [
        [
            "Вася",
            "Васечкин",
            [
                {
                    "task": {
                        "taskName": "Задача1",
                        "description": "Подпрыгнуть 10 раз"
                    },
                    "mark": 5
                }
            ],
            [
                3,
                1
            ]
        ],
        [
            "Петя",
            "Петячкин",
            [],
            [
                2,
                0
            ]
        ],
        [
            "Валя",
            "Валечкин",
            [
                {
                    "task": {
                        "taskName": "Задача2",
                        "description": "Подпрыгнуть 20 раз"
                    },
                    "mark": 4
                }
            ],
            [
                3,
                2
            ]
        ],
        [
            "Митя",
            "Митечкин",
            [],
            [
                1,
                3
            ]
        ],
        [
            "Витя",
            "Витечкин",
            [],
            [
                3,
                1
            ]
        ],
        [
            "Вика",
            "Викечкина",
            [],
            [
                3,
                2
            ]
        ],
        [
            "Маша",
            "Машечкина",
            [],
            [
                3,
                1
            ]
        ],
        [
            "Таня",
            "Танечкина",
            [],
            [
                2,
                1
            ]
        ],
        [
            "Даша",
            "Дашечкина",
            [],
            [
                1,
                3
            ]
        ],
        [
            "Юля",
            "Юлечкина",
            [],
            [
                2,
                0
            ]
        ]
    ],
    "teams": [
        [
            "Орлы",
            [
                0,
                1,
                2
            ],
            []
        ],
        [
            "Соколы",
            [
                3,
                4,
                5
            ],
            []
        ],
        [
            "Личинки",
            [
                6,
                7
            ],
            []
        ],
        [
            "Голуби",
            [
                8,
                9
            ],
            [
                {
                    "task": {
                        "taskName": "Задача3",
                        "description": "Подпрыгнуть 30 раз"
                    },
                    "mark": 1
                }
            ]
        ]
    ],
    "tasks": [
        [
            "Задача1",
            "Подпрыгнуть 10 раз"
        ],
        [
            "Задача2",
            "Подпрыгнуть 20 раз"
        ],
        [
            "Задача3",
            "Подпрыгнуть 30 раз"
        ],
        [
            "Задача4",
            "Подпрыгнуть 40 раз"
        ]
    ],
    "mentors": [
        [
            "Николай",
            "Николаев",
            [
                0,
                1
            ]
        ],
        [
            "Максим",
            "Максимов",
            [
                7,
                5
            ]
        ],
        [
            "Константин",
            "Константинов",
            [
                1,
                8
            ]
        ],
        [
            "Петр",
            "Петров",
            [
                2,
                6
            ]
        ]
    ]
}

SHRI.deserialize(source);

// console.log(JSON.stringify(SHRI, null, 4));

console.log(JSON.stringify(SHRI.serialize(), null, 4));